[
  {
    "id": "1758134675",
    "npc_name": "ф",
    "hero_name": "ИмяПерсонажа",
    "data": {
      "data": [
        {
          "id": 1,
          "to": [
            {
              "id": 2,
              "line": "Спасибо aa за теплый прием, Та. Я ищу древние артефакты, которые, как говорят, скрыты в этих землях. Может быть, ты знаешь что-нибудь о них?",
              "info": "kkk"
            }
          ],
          "info": "NPC приветствует главного героя, представляясь и выражая любопытство по поводу его появления.",
          "line": "\"Приветствую тебя, путник! Меня зовут Та. Я редко встречаю новых лиц в этих краях... Что привело тебя сюда? Надеюсь, твой путь будет удачным.\"",
          "meta": {},
          "mood": "нейтральный",
          "type": "M",
          "goal_achieve": 0
        },
        {
          "id": 2,
          "to": [
            {
              "id": 3,
              "line": "Твои слова вдохновляют меня, Та. Я готов искать союзников, чтобы вместе раскрыть тайны этих земель. Может быть, ты сможешь указать мне, с кем мне стоит поговорить?"
            }
          ],
          "info": "NPC рассказывает о своих приключениях в каменном веке, подчеркивая важность дружбы и сотрудничества.",
          "line": "О, древние артефакты! Давным-давно, когда я был молод и полон сил, мы с моими друзьями из племени искали подобные сокровища. Однажды мы нашли камень с таинственными знаками — он светился в темноте, как луна! Но самое важное — мы поняли, что только вместе, поддерживая друг друга, смогли разгадать его тайну. Без дружбы и доверия даже самый сильный воин не справился бы в одиночку. Если хочешь найти артефакты, ищи союзников — вместе вы сможете больше, чем поодиночке!",
          "meta": {
            "x": 494.5,
            "y": 35.0
          },
          "mood": "воодушевлёный",
          "type": "M",
          "goal_achieve": 0
        },
        {
          "id": 3,
          "to": [
            {
              "id": 4,
              "line": "Спасибо за предложение, Та, но я предпочитаю идти своим путём. Возможно, наши дороги ещё пересекутся."
            },
            {
              "id": 5,
              "line": "Я принимаю твою помощь, Та. Вместе мы сможем раскрыть больше тайн. Когда мы отправимся к старейшине?"
            }
          ],
          "info": "NPC спрашивает главного героя о его целях и предлагает помощь.",
          "line": "\"О, древние артефакты? Да, я слышала легенды о них! Они хранят мудрость наших предков, и если ты ищешь их с чистым сердцем, то удача будет на твоей стороне. В этих землях есть старейшина племени Орок — он знает больше всех о тайнах прошлого. Если хочешь, я могу проводить тебя к нему. А ещё... может, ты расскажешь, зачем тебе эти артефакты? Быть может, я смогу помочь не только советом?\"",
          "meta": {
            "x": 94.60535,
            "y": 278.1579
          },
          "mood": "благодарный",
          "type": "C",
          "goal_achieve": 0
        },
        {
          "id": 4,
          "to": [],
          "info": "Главный герой благодарит NPC за предложение помощи, но отказывается, желая идти своим путём.",
          "line": "\"Я уважаю твой выбор, путник. Пусть твоя дорога будет светлой, а ветер — попутным. Если когда-нибудь передумаешь или захочешь поделиться своими находками, моя пещера всегда открыта для тебя. Пусть духи предков укажут тебе верный путь!\"",
          "meta": {
            "x": 227.5,
            "y": 460.0
          },
          "mood": "благодарный",
          "type": "P",
          "goal_achieve": 1
        },
        {
          "id": 5,
          "to": [],
          "info": "Главный герой принимает предложение NPC о помощи, и они договариваются о совместном путешествии.",
          "line": "\"О, это чудесные новости, друг! Старейшина ждёт нас у священного камня за холмом. Он мудр и знает многие тайны этих земель. Давай отправимся туда сейчас же — солнце ещё высоко, и путь недолог. По дороге я расскажу тебе о знаках, которые помогут нам найти артефакты. Вместе мы точно раскроем все секреты!\"",
          "meta": {
            "x": 505.086121,
            "y": 332.4139
          },
          "mood": "радостный",
          "type": "P",
          "goal_achieve": 1
        }
      ]
    }
  }
]